InformationRegisters/КлассификаторыОграниченийМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КлассификаторыОграниченийМЧД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлассификаторыОграниченийМЧД/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обновляет данные классификаторов ограничений МЧД 003
// 
// Параметры:
// ДанныеКлассификатора - См. СервисНастроекЭДО.ПолучитьКлассификаторОграниченийМЧД
Процедура ОбновитьКлассификаторы(Знач ДанныеКлассификатора) Экспорт
	
	ОбновлениеВыполнено = Ложь;
	ТекстОшибки = 
		НСтр("ru = 'Не удалось получить из сервиса настроек данные классификаторов ограничений (МЧД 003). Обратитесь в техподдержку.'");
	
	КонтекстДиагностики = ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики();
	
	КаталогРаспаковки = ФайловаяСистема.СоздатьВременныйКаталог();
	РаспакованныеФайлы = РаботаСФайламиБЭД.РаспаковатьАрхив(ДанныеКлассификатора.ДанныеФайла,
		КаталогРаспаковки, КонтекстДиагностики, НСтр("ru = 'Распаковка архива данных классификатора ограничений (МЧД 003).'"));
	
	Если РаспакованныеФайлы = Неопределено Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Для Каждого РаспакованныйФайл Из РаспакованныеФайлы Цикл 
		
		ИдентификаторФайла = ИдентификаторФайлаПоИмени(РаспакованныйФайл.Имя);
		
		Если ИдентификаторФайла <> Неопределено Тогда 
			
			ДанныеРаспакованногоФайла = Новый ДвоичныеДанные(РаспакованныйФайл.ПолноеИмя);
			ДанныеСтрока = ПолучитьСтрокуИзДвоичныхДанных(ДанныеРаспакованногоФайла, КодировкаТекста.UTF8);
			ЗаписатьДанныеФайла(ИдентификаторФайла, ДанныеСтрока, ДанныеКлассификатора.ДатаПоследнегоИзменения);
			
			ОбновлениеВыполнено = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РаботаСФайламиБЭД.УдалитьВременныеФайлы(КаталогРаспаковки);
		
	Если Не ОбновлениеВыполнено Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает таблицу значений содержащую данные классификатора ограничений МЧД 003
// 
// Возвращаемое значение:
//  - ТаблицаЗначений:
// 	* Код - Строка
// 	* Наименование - Строка
// 	* Описание - Строка
// 	* ДействуетС - Дата
// 	* Отозвано - Булево 
Функция КлассификаторОграничений() Экспорт
	
	ДанныеКлассификатора = НовыйОписаниеДанныхКлассификатораОграничений();
	КодКлассификатора = КодКлассификатораОграниченияПолномочий();
	
	ДанныеФайлаТекст = ДанныеФайла(ИдентификаторКлассификатораОграничений());
	РезультатЧтенияДанныхФайла = ПрочитатьДанныеФайла(ДанныеФайлаТекст, ИмяМакетаОграниченияПолномочий(), 
		КодКлассификатора);
		
	ЗаполнитьДанныеКлассификатораИзРезультатаЧтенияДанныхФайла(ДанныеКлассификатора, РезультатЧтенияДанныхФайла, 
		КодКлассификатора);
	
	Возврат ДанныеКлассификатора;
	
КонецФункции

// Возвращает таблицу значений содержащую данные классификатора значений ограничений МЧД 003.
// 
// Возвращаемое значение:
//  - ТаблицаЗначений:
// 	* Код - Строка
// 	* КодОграничения - Строка
// 	* Наименование - Строка
// 	* ДействуетС - Дата
// 	* Отозвано - Булево
Функция КлассификаторЗначенийОграничений() Экспорт
	
	ДанныеКлассификатора = НовыйОписаниеДанныхКлассификатораЗначенийОграничений();
	КодКлассификатора = КодКлассификатораЗначенияОграниченияПолномочий();
	
	ДанныеФайлаТекст = ДанныеФайла(ИдентификаторКлассификатораЗначенийОграничений());
	РезультатЧтенияДанныхФайла = ПрочитатьДанныеФайла(ДанныеФайлаТекст, ИмяМакетаЗначенияОграниченияПолномочий(), 
		КодКлассификатора);
		
	ЗаполнитьДанныеКлассификатораИзРезультатаЧтенияДанныхФайла(ДанныеКлассификатора, РезультатЧтенияДанныхФайла, 
		КодКлассификатора);
	
	Возврат ДанныеКлассификатора;
	
КонецФункции

// Записывает данные файла содержащего данные классификатор ограничений МЧД 003 
// в регистр сведений Классификатор ограничений МЧД.
// 
// Параметры:
//  ИдентификаторФайла - УникальныйИдентификатор
//  Данные - Строка
//  ДатаИзмененияФайла - Дата
Процедура ЗаписатьДанныеФайла(ИдентификаторФайла, Данные, ДатаИзмененияФайла)
	
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаДанных = Новый БлокировкаДанных();
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КлассификаторыОграниченийМЧД");
	ЭлементБлокировкиДанных.УстановитьЗначение("Идентификатор", ИдентификаторФайла);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Идентификатор.Установить(ИдентификаторФайла);
	
	Запись = НаборЗаписей.Добавить();
	Запись.Идентификатор = ИдентификаторФайла;
	Запись.Данные = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	Запись.ДатаИзменения = ДатаИзмененияФайла;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных.Заблокировать();
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Файл %1 обновлен.'"),
		Строка(ИдентификаторФайла));
	ЗаписатьВЖурналРегистрации(Комментарий);
	
КонецПроцедуры

// Получает текстовые данные классификатора по уникальному идентификатору файла.
// 
// Параметры:
//  ИдентификаторФайла - УникальныйИдентификатор
// 
// Возвращаемое значение:
// - Неопределено, 
// - Строка
Функция ДанныеФайла(Знач ИдентификаторФайла)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КлассификаторыОграниченийМЧД.Данные
	|ИЗ
	|	РегистрСведений.КлассификаторыОграниченийМЧД КАК КлассификаторыОграниченийМЧД
	|ГДЕ
	|	КлассификаторыОграниченийМЧД.Идентификатор = &Идентификатор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Данные.Получить()
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращаемое значение:
//  УникальныйИдентификатор
Функция ИдентификаторКлассификатораОграничений()
	Возврат Новый УникальныйИдентификатор("ae908b89-f44c-495f-a733-4cd6a5d96692");
КонецФункции

// Возвращаемое значение:
//  УникальныйИдентификатор
Функция ИдентификаторКлассификатораЗначенийОграничений()
	Возврат Новый УникальныйИдентификатор("af31952b-b262-4c8e-b049-2eed00782193");
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяФайлаКлассификатораОграничений()
	Возврат "POWER_PWR_RESTR_UTF_8.json";
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяФайлаКлассификатораЗначенийОграничений()
	Возврат "POWER_PWR_RESTR_VALUE_UTF_8.json";
КонецФункции

// Возвращает идентификатор файла классификатора по его имени.
// 
// Параметры:
//  ИмяФайла - Строка
// 
// Возвращаемое значение:
//  - Неопределено, 
//  - УникальныйИдентификатор
Функция ИдентификаторФайлаПоИмени(ИмяФайла)
	
	Если НРег(ИмяФайла) = НРег(ИмяФайлаКлассификатораОграничений()) Тогда
		Возврат ИдентификаторКлассификатораОграничений();
		
	ИначеЕсли НРег(ИмяФайла) = НРег(ИмяФайлаКлассификатораЗначенийОграничений()) Тогда
		Возврат ИдентификаторКлассификатораЗначенийОграничений();
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Обновление классификаторов МЧД'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Процедура ЗаписатьВЖурналРегистрации(Комментарий, Уровень = Неопределено)
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРегистрации(), Уровень,
		Метаданные.РегистрыСведений.КлассификаторыОграниченийМЧД, , Комментарий);
	
КонецПроцедуры

#Область ЧтениеДанныхКлассификатора

// Возвращает результат чтения данных классификаторов ограничений МЧД и значений ограничений МЧД.
// 
// Параметры:
//  ДанныеФайлаТекст - Неопределено, 
//  				 - Строка
//  ИмяМакетаСДаннымиПоУмолчанию - Строка
//  КодКлассификатора - Строка
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ПрочитатьДанныеФайла(Знач ДанныеФайлаТекст, Знач ИмяМакетаСДаннымиПоУмолчанию, Знач КодКлассификатора);
	
	РезультатЧтенияДанныхФайла = Новый ТаблицаЗначений;
	
	ЭтоJSON = Истина; 
	
	Попытка
		ДанныеJSON = ОбщегоНазначения.JSONВЗначение(ДанныеФайлаТекст, , Ложь); // Структура
	Исключение
		ЭтоJSON = Ложь;
	КонецПопытки;
	
	Если Не ЭтоJSON Тогда
		
		ДанныеФайлаТекст = ПолучитьМакет(ИмяМакетаСДаннымиПоУмолчанию).ПолучитьТекст(); 
		
		Попытка
			ДанныеJSON = ОбщегоНазначения.JSONВЗначение(ДанныеФайлаТекст, , Ложь); // Структура
		Исключение
			Возврат РезультатЧтенияДанныхФайла;
		КонецПопытки;
		
	КонецЕсли; 
	
	СловарьАтрибутов = Новый Соответствие;
		
	РезультатЧтенияДанныхФайла = СоздатьОписаниеРезультатаЧтенияДанныхФайла(ДанныеJSON, СловарьАтрибутов);
	ЗаполнитьРезультатЧтенияДанныхФайла(РезультатЧтенияДанныхФайла, ДанныеJSON, СловарьАтрибутов);
	ИзменитьОписаниеРезультатаЧтенияДанныхФайла(РезультатЧтенияДанныхФайла, КодКлассификатора);
		
	Возврат РезультатЧтенияДанныхФайла;
	
КонецФункции   

// Создает пустую таблицу результата чтения данных файла, на основании структуры данных файла классификатора
// 
// Параметры:
//  ДанныеJSON - Структура
//  СловарьАтрибутов - Соответствие из КлючИЗначение
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
Функция СоздатьОписаниеРезультатаЧтенияДанныхФайла(Знач ДанныеJSON, СловарьАтрибутов)
	
	Атрибуты = ДанныеJSON.classifier.attributes; // Массив из Структура
	
	Результат = Новый ТаблицаЗначений;
			
	Для Каждого Атрибут Из Атрибуты Цикл
		
		ИмяКолонки = Атрибут.name; // Строка
		ТипЗначения = Атрибут.type; // Строка
		
		ТипКолонки = Новый ОписаниеТипов("Строка");
		
		Если ТипЗначения = "INTEGER" Тогда
			ТипКолонки = Новый ОписаниеТипов("Число");
		ИначеЕсли ТипЗначения = "DATE" Тогда
			ТипКолонки = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
		КонецЕсли;
		
		Результат.Колонки.Добавить(ИмяКолонки, ТипКолонки);
		
		СловарьАтрибутов.Вставить(Атрибут.uid, ИмяКолонки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//Возвращает результат чтения данных файла классификатора
// 
// Параметры:
//  РезультатЧтения - ТаблицаЗначений 
//  ДанныеJSON - Структура
//  СловарьАтрибутов - Соответствие из КлючИЗначение
Процедура ЗаполнитьРезультатЧтенияДанныхФайла(РезультатЧтения, Знач ДанныеJSON, Знач СловарьАтрибутов)

	Записи = ДанныеJSON.data.records; // Массив из Структура
	
	Для Каждого Запись Из Записи Цикл
		
		НоваяСтрока = РезультатЧтения.Добавить();
		
		Для Каждого АтрибутЗначение Из Запись.attributeValues Цикл
			
			UIDАтрибута = АтрибутЗначение.attributeUid; // Строка
			Значение = АтрибутЗначение.value; // Строка
			
			ИмяКолонки = СловарьАтрибутов.Получить(UIDАтрибута); // Строка
			
			Если ИмяКолонки <> Неопределено Тогда
				
				Колонка = РезультатЧтения.Колонки.Найти(ИмяКолонки);
				ТипКолонки = Колонка.ТипЗначения;
					
				Если ТипКолонки.СодержитТип(Тип("Дата")) И ТипЗнч(Значение) = Тип("Число") Тогда
					Значение = ОбщегоНазначенияБЭД.ДатаИзУниверсальнойДатыВМиллисекундах(Значение);
				КонецЕсли;
					
				НоваяСтрока[ИмяКолонки] = Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Заменяет имена колонок в результате чтения данных файла на имена колонок классификатора.
// 
// Параметры:
//  РезультатЧтения - ТаблицаЗначений  
//  КодКлассификатора - Строка
Процедура ИзменитьОписаниеРезультатаЧтенияДанныхФайла(РезультатЧтения, Знач КодКлассификатора)
	
	НовыеИменаКолонок = НовыеИменаКолонокРезультатаЧтенияДанныхФайла().Получить(КодКлассификатора);
	Для Каждого ТекущаяКолонка Из РезультатЧтения.Колонки Цикл
		
		НовоеИмяЗначение = НовыеИменаКолонок.Получить(ТекущаяКолонка.Имя); //Строка
		Если НовоеИмяЗначение <> Неопределено Тогда
			ТекущаяКолонка.Имя = НовоеИмяЗначение; 
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

// Заполняет данные классификатора из результата чтения данных файла.
// 
// Параметры:
//  ДанныеКлассификатора - ТаблицаЗначений - Итоговый результат:
//  РезультатЧтенияДанныхФайла - ТаблицаЗначений - Результат чтения данных файла:
//  КодКлассификатора - Строка
Процедура ЗаполнитьДанныеКлассификатораИзРезультатаЧтенияДанныхФайла(ДанныеКлассификатора, Знач РезультатЧтенияДанныхФайла, 
		Знач КодКлассификатора)
	
	Для Каждого ТекущаяСтрока Из РезультатЧтенияДанныхФайла Цикл 
		НоваяСтрока = ДанныеКлассификатора.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		ДополнитьДанныеКлассификатораСведениямиОбОтзыве(НоваяСтрока, ТекущаяСтрока, КодКлассификатора);
		ДополнитьДанныеКлассификатораСведениямиНачалаДействия(НоваяСтрока, ТекущаяСтрока, КодКлассификатора);
		
	КонецЦикла;
		
КонецПроцедуры

// Дополняет данные классификатора сведениями об отзыве, на основе условных данных.
// 
// Параметры:
//  НоваяСтрока - СтрокаТаблицыЗначений
//  ТекущаяСтрока - СтрокаТаблицыЗначений
//  КодКлассификатора - Строка
Процедура ДополнитьДанныеКлассификатораСведениямиОбОтзыве(НоваяСтрока, Знач ТекущаяСтрока, Знач КодКлассификатора)
	
	ИмяКолонкиДатаОтзываИсточник = ИмяКолонкиДатаОтзыва().Получить(КодКлассификатора);
	Если ИмяКолонкиДатаОтзываИсточник = Неопределено Тогда 
		Возврат;
	КонецЕсли; 
	
	КолонкиИсточник = ТекущаяСтрока.Владелец().Колонки;
	Если КолонкиИсточник.Найти(ИмяКолонкиДатаОтзываИсточник) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиПремник = НоваяСтрока.Владелец().Колонки;
	Если КолонкиПремник.Найти("Отозвано") = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ДатаОтзыва = ТекущаяСтрока[ИмяКолонкиДатаОтзываИсточник]; // Строка, Дата
	Если ТипЗнч(ДатаОтзыва) = Тип("Строка") Тогда
		ДатаОтзыва = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаОтзыва); // Дата
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОтзыва) Тогда
		НоваяСтрока.Отозвано = ДатаОтзыва < ТекущаяДатаСеанса();  
	КонецЕсли;
	
КонецПроцедуры

// Дополнить данные классификатора сведениями даты начала действия значения ограничения полномочия.
// 
// Параметры:
//  НоваяСтрока - СтрокаТаблицыЗначений
//  ТекущаяСтрока - СтрокаТаблицыЗначений
//  КодКлассификатора - Строка
Процедура ДополнитьДанныеКлассификатораСведениямиНачалаДействия(НоваяСтрока, Знач ТекущаяСтрока, Знач КодКлассификатора)
	
	Если КодКлассификатора <> КодКлассификатораЗначенияОграниченияПолномочий() Тогда 
		Возврат;
	КонецЕсли;
	
	КолонкиИсточник = ТекущаяСтрока.Владелец().Колонки;
	Если КолонкиИсточник.Найти("ДействуетС") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КолонкиПремник = НоваяСтрока.Владелец().Колонки;
	Если КолонкиПремник.Найти("ДействуетС") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаДействия = ТекущаяСтрока.ДействуетС;
	Если ТипЗнч(ДатаНачалаДействия) = Тип("Строка") Тогда
		НоваяСтрока.ДействуетС = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаНачалаДействия); // Дата
	КонецЕсли;
	
КонецПроцедуры

// Возвращаемое значение:
//  ТаблицаЗначений - Новый описание данных классификатора ограничений:
// * Код - Строка
// * Наименование - Строка
// * Описание - Строка
// * ДействуетС - Дата
// * Отозвано - Булево
Функция НовыйОписаниеДанныхКлассификатораОграничений()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("Наименование",ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("ДействуетС", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("Отозвано", Новый ОписаниеТипов("Булево"));
	
	Возврат Результат;
	
КонецФункции 

// Возвращаемое значение:
//  ТаблицаЗначений - Новый описание данных классификатора значений ограничений:
// * Код - Строка
// * КодОграничения - Строка
// * Наименование - Строка
// * ДействуетС - Дата
// * Отозвано - Булево
Функция НовыйОписаниеДанныхКлассификатораЗначенийОграничений()
	                                                                            
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Код",ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("КодОграничения", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("Наименование",ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Результат.Колонки.Добавить("ДействуетС",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Результат.Колонки.Добавить("Отозвано", Новый ОписаниеТипов("Булево"));
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение
Функция НовыеИменаКолонокРезультатаЧтенияДанныхФайла()

	Результат = Новый Соответствие;
	Результат.Вставить(КодКлассификатораОграниченияПолномочий(), 
		НовыеИменаКолонокКлассификатораОграничений());
	Результат.Вставить(КодКлассификатораЗначенияОграниченияПолномочий(), 
		НовыеИменаКолонокКлассификатораЗначенияОграничений());
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение
Функция НовыеИменаКолонокКлассификатораОграничений()
	
	Результат = Новый Соответствие;
	Результат.Вставить("CODE", "Код");
	Результат.Вставить("NAME", "Наименование");
	Результат.Вставить("DESCRIPTION", "Описание"); 
	Результат.Вставить("STARTED", "ДействуетС");  
		
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение
Функция НовыеИменаКолонокКлассификатораЗначенияОграничений()
	
	Результат = Новый Соответствие;
	Результат.Вставить("CODE_VALUE", "Код");
	Результат.Вставить("NAME_VALUE", "Наименование");
	Результат.Вставить("CODE", "КодОграничения"); 
	Результат.Вставить("STARTED", "ДействуетС");  
		
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие из КлючИЗначение
Функция ИмяКолонкиДатаОтзыва()
	
	Результат = Новый Соответствие;
	Результат.Вставить(КодКлассификатораОграниченияПолномочий(), "REVOKED");
	Результат.Вставить(КодКлассификатораЗначенияОграниченияПолномочий(), "REVOKED");
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция КодКлассификатораОграниченияПолномочий()
	
	Возврат "POWER_PWR_RESTR";
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция КодКлассификатораЗначенияОграниченияПолномочий()
	
	Возврат "POWER_PWR_RESTR_VALUE";
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяМакетаОграниченияПолномочий()
	
	Возврат "ОграниченияПолномочий";
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция ИмяМакетаЗначенияОграниченияПолномочий()
	
	Возврат "ЗначенияОграниченийПолномочий";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
